## Read Data From CSV

In [1]:
import pandas as pd

csv_file = "./data/clean_hawaii_measurements.csv"
csv_df = pd.read_csv(csv_file)
csv_df.head()

       station        date  prcp  tobs
0  USC00519397  2010-01-01  0.08    65
1  USC00519397  2010-01-02  0.00    63
2  USC00519397  2010-01-03  0.00    74
3  USC00519397  2010-01-04  0.00    76
4  USC00519397  2010-01-06   NaN    73

## Read Data From Excel

In [2]:
import pandas as pd

excel_file = './data/StudentGrades_Solved.xlsx'
excel_df = pd.read_excel(excel_file) 
excel_df.head()

                Jan  Feb  Mar  Apr  May  Jun
Tad Ethridge     64   70   65   64   56   63
Veda Sanon       57   66   62   67   76   67
Timothy Trimm    63   71   76   77   82   85
Odelia Nelsen    97   99   93  100   94   99
Aleisha Lavine   92   85   91   94   91   84

## Read Data From JSON API Request

In [3]:
import requests
import json
import pandas as pd
from pprint import pprint

url = "http://www.omdbapi.com/?t="
api_key = "&apikey=trilogy"


response = requests.get(url + "Rocky" + api_key)
print(response.url)

http://www.omdbapi.com/?t=Rocky&apikey=trilogy

In [4]:
json_api_df = pd.read_json(response.url) 
json_api_df.head()

,Title,Year,Rated,Released,Runtime,Genre,Director,Writer,Actors,Plot,...,Metascore,imdbRating,imdbVotes,imdbID,Type,DVD,BoxOffice,Production,Website,Response
0,Rocky,1976,PG,03 Dec 1976,120 min,"Drama, Sport",John G. Avildsen,Sylvester Stallone,"Sylvester Stallone, Talia Shire, Burt Young, C...",A small-time boxer gets a supremely rare chanc...,...,70,8.1,"467,776",tt0075148,movie,07 Aug 2006,N/A,United Artists,http://rockythemovie.com/,True
1,Rocky,1976,PG,03 Dec 1976,120 min,"Drama, Sport",John G. Avildsen,Sylvester Stallone,"Sylvester Stallone, Talia Shire, Burt Young, C...",A small-time boxer gets a supremely rare chanc...,...,70,8.1,"467,776",tt0075148,movie,07 Aug 2006,N/A,United Artists,http://rockythemovie.com/,True
2,Rocky,1976,PG,03 Dec 1976,120 min,"Drama, Sport",John G. Avildsen,Sylvester Stallone,"Sylvester Stallone, Talia Shire, Burt Young, C...",A small-time boxer gets a supremely rare chanc...,...,70,8.1,"467,776",tt0075148,movie,07 Aug 2006,N/A,United Artists,http://rockythemovie.com/,True

## Read Data From JSON URL

In [5]:
import pandas as pd

json_url = 'https://raw.githubusercontent.com/chrisalbon/simulated_datasets/master/data.json'
json_url_df = pd.read_json(json_url) 
json_url_df.head()

    integer            datetime  category
0         5 2015-01-01 00:00:00         0
1         5 2015-01-01 00:00:01         0
10        5 2015-01-01 00:00:10         0
11        5 2015-01-01 00:00:11         0
12        8 2015-01-01 00:00:12         0

## Read Data From JSON File

In [6]:
#json validator to confirm your file is really in json format, https://jsonlint.com/

import json
import pandas as pd

json_file = './data/friends.json'

with open(json_file) as datafile:
    data = json.load(datafile)
json_file_df = pd.DataFrame(data['friends'])
json_file_df.head()

               name                                              photo
0             Ahmed  https://media.licdn.com/mpr/mpr/shrinknp_200_2...
1      Jacob Deming  https://pbs.twimg.com/profile_images/691785039...
2  Jeremiah Scanlon  https://avatars2.githubusercontent.com/u/85049...
3    Louis T. Delia  https://pbs.twimg.com/profile_images/639214960...
4        Lou Ritter  https://media.licdn.com/mpr/mpr/shrinknp_400_4...

## Read Data From SQLite

In [7]:
# CONNECT TO MYSQL

#pip install mysql-connector-python
import pandas as pd
from sqlalchemy import create_engine

sqllite_db = './data/surfer.sqlite'

engine = create_engine(f"sqlite:///{sqllite_db}")

In [8]:
# UNCOVER DB TABLE NAMES
engine.table_names()

['surfboards', 'surfers']

In [9]:
# READ TABLE CONTENTS
conn = engine.connect()
sqlite_df = pd.read_sql("SELECT * FROM surfboards", conn)
sqlite_df.head()

   id  surfer_id board_name color  length
0   1          1   Awwwyeah  Blue      68
1   2          1   Awwwyeah  Blue      68

In [10]:
# READ TABLE CONTENTS
sqlite_df = pd.read_sql("SELECT * FROM surfers", conn)
sqlite_df.head()

   id   name hometown wipeouts  rank
0   1  Bruno       LA     None    10
1   2  Bruno       LA     None    10

## Read Data From MySQL

In [11]:
# CONNECT TO MYSQL

#pip install mysql-connector-python
import pandas as pd
from sqlalchemy import create_engine
import mysql.connector

#database must already exist in a MySQL 
#connection_string = '<username>:<password>@localhost/<database name>'
connection_string = 'root:Ax127kSp@localhost/customer2_db'

engine = create_engine(f'mysql+mysqlconnector://{connection_string}')

print(engine)

Engine(mysql+mysqlconnector://demouser:***@localhost/customer2_db)

In [12]:
# UNCOVER DB TABLE NAMES
engine.table_names()

['county', 'datetime', 'premise']

In [13]:
# READ TABLE CONTENTS
conn = engine.connect()
mysql_df = pd.read_sql("SELECT * FROM county", conn)
mysql_df.head()

   id  county_name  license_count  county_id
0   0       ALBANY             77          5
1   1     ALLEGANY              4         59
2   2        BRONX            104          0
3   3       BROOME             14         35
4   4  CATTARAUGUS              9         41

## Read Data From Mongo

In [14]:
#CONNECT TO MONGODB

import pymongo
import pandas as pd

# Make sure to run 'sudo mongod' (MAC) or mongod (WINDOWS)

# The default port used by MongoDB is 27017
conn = 'mongodb://localhost:27017'
client = pymongo.MongoClient(conn)
client

MongoClient(host=['localhost:27017'], document_class=dict, tz_aware=False, connect=True)

In [15]:
# DECLARE DATABASE
db = client.test

# DECLARE COLLECTION
collection = db.places
collection

Collection(Database(MongoClient(host=['localhost:27017'], document_class=dict, tz_aware=False, connect=True), 'test'), 'places')

In [16]:
#READ COLLECTION CONTENTS
results = collection.find()
mongo_df = pd.DataFrame(list(results))
mongo_df.head()

                        _id                   cities continent  country
0  5cb5497de8d56054d6b93c90  [Casablanca, Fez, Marr]    Africa  Morroco
1  5cb54db738eddb82d049242e  [Casablanca, Fez, Marr]    Africa  Morroco
2  5cb54db838eddb82d049242f  [Casablanca, Fez, Marr]    Africa  Morroco
3  5cb54db938eddb82d0492430  [Casablanca, Fez, Marr]    Africa  Morroco

## Load DataFrame Into MySQL

In [17]:
# CONNECT TO MYSQL

#pip install mysql-connector-python
import pandas as pd
from sqlalchemy import create_engine
import mysql.connector

#database must already exist in a MySQL 
#connection_string = '<username>:<password>@localhost/<database name>'
connection_string = 'root:Ax127kSp@localhost/customer2_db'

engine = create_engine(f'mysql+mysqlconnector://{connection_string}')

print(engine)

Engine(mysql+mysqlconnector://demouser:***@localhost/customer2_db)

In [18]:
# CHECK FOR ALREADY EXISTING TABLES (OPTIONAL)
engine.table_names()

['county', 'datetime', 'premise']

In [19]:
# READ TABLE CONTENTS IF EXISTS (OPTIONAL)
conn = engine.connect()
county_df = pd.read_sql("SELECT * FROM county", conn)
county_df.head()

   id  county_name  license_count  county_id
0   0       ALBANY             77          5
1   1     ALLEGANY              4         59
2   2        BRONX            104          0
3   3       BROOME             14         35
4   4  CATTARAUGUS              9         41

In [20]:
# ADD DATA TO TABLE
json_url_df.to_sql(name='datetime', con=engine, if_exists='append', index=True)
json_url_df.head()

    integer            datetime  category
0         5 2015-01-01 00:00:00         0
1         5 2015-01-01 00:00:01         0
10        5 2015-01-01 00:00:10         0
11        5 2015-01-01 00:00:11         0
12        8 2015-01-01 00:00:12         0

In [21]:
# CHECK FOR EXISTING TABLES (OPTIONAL)
engine.table_names()

['county', 'datetime', 'premise']

## Load DataFrame Into Mongo

In [22]:
#CONNECT TO MONGODB

import pymongo
import pandas as pd

# Make sure to run 'sudo mongod' (MAC) or mongod (WINDOWS)

# The default port used by MongoDB is 27017
conn = 'mongodb://localhost:27017'
client = pymongo.MongoClient(conn)
client

MongoClient(host=['localhost:27017'], document_class=dict, tz_aware=False, connect=True)

In [23]:
# DECLARE DATABASE
db = client.test

In [24]:
#READ CURRENT CONTENTS (OPTIONAL)

results = db.places.find()
mongo_df = pd.DataFrame(list(results))
mongo_df.head()

                        _id                   cities continent  country
0  5cb5497de8d56054d6b93c90  [Casablanca, Fez, Marr]    Africa  Morroco
1  5cb54db738eddb82d049242e  [Casablanca, Fez, Marr]    Africa  Morroco
2  5cb54db838eddb82d049242f  [Casablanca, Fez, Marr]    Africa  Morroco
3  5cb54db938eddb82d0492430  [Casablanca, Fez, Marr]    Africa  Morroco

In [25]:
# INSERT DATA INTO NEW COLLECTION

date_collection = db.datetime

records = json.loads(json_url_df.T.to_json()).values()
db.datetime.insert_many(records)

In [26]:
# CHECK NEWLY INSERTED CONTENTS (OPTIONAL)

new_data = db.datetime.find()
for data in new_data:
    print(data)

{'_id': ObjectId('5cc3fec1a4598b5b434c0814'), 'integer': 5, 'datetime': 1420070400000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c0815'), 'integer': 5, 'datetime': 1420070401000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c0816'), 'integer': 5, 'datetime': 1420070410000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c0817'), 'integer': 5, 'datetime': 1420070411000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c0818'), 'integer': 8, 'datetime': 1420070412000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c0819'), 'integer': 9, 'datetime': 1420070413000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c081a'), 'integer': 8, 'datetime': 1420070414000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c081b'), 'integer': 8, 'datetime': 1420070415000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c081c'), 'integer': 2, 'datetime': 1420070416000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c081d'), 'integer': 1, 'datetime': 1420070417000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c081e'), 'integer': 4, 'datetime': 1420070418000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c081f'), 'integer': 8, 'datetime': 1420070419000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c0820'), 'integer': 9, 'datetime': 1420070402000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c0821'), 'integer': 9, 'datetime': 1420070420000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c0822'), 'integer': 5, 'datetime': 1420070421000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c0823'), 'integer': 4, 'datetime': 1420070422000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c0824'), 'integer': 8, 'datetime': 1420070423000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c0825'), 'integer': 6, 'datetime': 1420070424000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c0826'), 'integer': 4, 'datetime': 1420070425000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c0827'), 'integer': 5, 'datetime': 1420070426000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c0828'), 'integer': 6, 'datetime': 1420070427000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c0829'), 'integer': 3, 'datetime': 1420070428000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c082a'), 'integer': 7, 'datetime': 1420070429000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c082b'), 'integer': 6, 'datetime': 1420070403000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c082c'), 'integer': 9, 'datetime': 1420070430000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c082d'), 'integer': 8, 'datetime': 1420070431000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c082e'), 'integer': 8, 'datetime': 1420070432000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c082f'), 'integer': 4, 'datetime': 1420070433000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c0830'), 'integer': 8, 'datetime': 1420070434000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c0831'), 'integer': 2, 'datetime': 1420070435000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c0832'), 'integer': 1, 'datetime': 1420070436000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c0833'), 'integer': 4, 'datetime': 1420070437000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c0834'), 'integer': 8, 'datetime': 1420070438000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c0835'), 'integer': 3, 'datetime': 1420070439000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c0836'), 'integer': 6, 'datetime': 1420070404000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c0837'), 'integer': 5, 'datetime': 1420070440000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c0838'), 'integer': 3, 'datetime': 1420070441000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c0839'), 'integer': 1, 'datetime': 1420070442000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c083a'), 'integer': 4, 'datetime': 1420070443000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c083b'), 'integer': 6, 'datetime': 1420070444000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c083c'), 'integer': 4, 'datetime': 1420070445000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c083d'), 'integer': 6, 'datetime': 1420070446000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c083e'), 'integer': 3, 'datetime': 1420070447000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c083f'), 'integer': 2, 'datetime': 1420070448000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c0840'), 'integer': 2, 'datetime': 1420070449000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c0841'), 'integer': 9, 'datetime': 1420070405000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c0842'), 'integer': 5, 'datetime': 1420070450000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c0843'), 'integer': 7, 'datetime': 1420070451000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c0844'), 'integer': 9, 'datetime': 1420070452000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c0845'), 'integer': 5, 'datetime': 1420070453000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c0846'), 'integer': 9, 'datetime': 1420070454000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c0847'), 'integer': 6, 'datetime': 1420070455000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c0848'), 'integer': 6, 'datetime': 1420070456000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c0849'), 'integer': 5, 'datetime': 1420070457000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c084a'), 'integer': 1, 'datetime': 1420070458000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c084b'), 'integer': 8, 'datetime': 1420070459000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c084c'), 'integer': 7, 'datetime': 1420070406000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c084d'), 'integer': 4, 'datetime': 1420070460000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c084e'), 'integer': 4, 'datetime': 1420070461000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c084f'), 'integer': 9, 'datetime': 1420070462000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c0850'), 'integer': 4, 'datetime': 1420070463000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c0851'), 'integer': 7, 'datetime': 1420070464000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c0852'), 'integer': 7, 'datetime': 1420070465000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c0853'), 'integer': 7, 'datetime': 1420070466000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c0854'), 'integer': 9, 'datetime': 1420070467000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c0855'), 'integer': 5, 'datetime': 1420070468000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c0856'), 'integer': 5, 'datetime': 1420070469000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c0857'), 'integer': 1, 'datetime': 1420070407000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c0858'), 'integer': 5, 'datetime': 1420070470000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c0859'), 'integer': 8, 'datetime': 1420070471000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c085a'), 'integer': 4, 'datetime': 1420070472000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c085b'), 'integer': 9, 'datetime': 1420070473000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c085c'), 'integer': 9, 'datetime': 1420070474000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c085d'), 'integer': 8, 'datetime': 1420070475000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c085e'), 'integer': 9, 'datetime': 1420070476000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c085f'), 'integer': 1, 'datetime': 1420070477000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c0860'), 'integer': 1, 'datetime': 1420070478000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c0861'), 'integer': 7, 'datetime': 1420070479000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c0862'), 'integer': 6, 'datetime': 1420070408000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c0863'), 'integer': 1, 'datetime': 1420070480000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c0864'), 'integer': 7, 'datetime': 1420070481000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c0865'), 'integer': 1, 'datetime': 1420070482000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c0866'), 'integer': 1, 'datetime': 1420070483000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c0867'), 'integer': 4, 'datetime': 1420070484000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c0868'), 'integer': 8, 'datetime': 1420070485000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c0869'), 'integer': 6, 'datetime': 1420070486000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c086a'), 'integer': 1, 'datetime': 1420070487000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c086b'), 'integer': 2, 'datetime': 1420070488000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c086c'), 'integer': 8, 'datetime': 1420070489000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c086d'), 'integer': 9, 'datetime': 1420070409000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c086e'), 'integer': 1, 'datetime': 1420070490000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c086f'), 'integer': 5, 'datetime': 1420070491000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c0870'), 'integer': 7, 'datetime': 1420070492000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c0871'), 'integer': 9, 'datetime': 1420070493000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c0872'), 'integer': 5, 'datetime': 1420070494000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c0873'), 'integer': 9, 'datetime': 1420070495000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c0874'), 'integer': 8, 'datetime': 1420070496000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c0875'), 'integer': 6, 'datetime': 1420070497000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c0876'), 'integer': 8, 'datetime': 1420070498000, 'category': 0}
{'_id': ObjectId('5cc3fec1a4598b5b434c0877'), 'integer': 1, 'datetime': 1420070499000, 'category': 0}